## 01. 엑셀에서 데이터프레임 불러오기

In [1]:
import pandas as pd

In [35]:
url = "/Users/mac/Documents/Mac mini/Python/1. 학습/1. 파이썬으로 할 수 있는 모든것/5. 데이터 분석 및 시각화/0. 강의자료/CH2_Excel file/02_01_read_excel.xlsx"

In [36]:
df = pd.read_excel(url)

In [37]:
df

    이름  국어  영어  수학
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [38]:
pd.read_excel(url, sheet_name= 1)

     두   번   째  시트
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [39]:
pd.read_excel(url, sheet_name = 2, header = 0)

  Unnamed: 0 Unnamed: 1 Unnamed: 2 Unnamed: 3
0        NaN        NaN        NaN        NaN
1         이름         국어         영어         수학
2        송중기         63         93         97
3        김나현         89         83         71
4        권보아         83         76         92
5        박효신         94         88         73

In [40]:
pd.read_excel(url, sheet_name = 2, header = 2)

    이름  국어  영어  수학
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [41]:
pd.read_excel(url, sheet_name=3)

  Unnamed: 0  국어  영어  수학
0        송중기  63  93  97
1        김나현  89  83  71
2        권보아  83  76  92
3        박효신  94  88  73

In [42]:
pd.read_excel(url, sheet_name=2, header=2, index_col=0)

     국어  영어  수학
이름
송중기  63  93  97
김나현  89  83  71
권보아  83  76  92
박효신  94  88  73

## 02. 단일요건 vlookup

In [43]:
import pandas as pd

In [44]:
url = "/Users/mac/Documents/Mac mini/Python/1. 학습/1. 파이썬으로 할 수 있는 모든것/5. 데이터 분석 및 시각화/0. 강의자료/CH2_Excel file/02_02_merge01.xlsx"
df = pd.read_excel(url)

In [45]:
df

      이름     제품
0    백철민   아이스티
1    박태인  레몬에이드
2    국지용  아메리카노
3    강민석  레몬에이드
4    박훈정   아이스티
..   ...    ...
369  김경남  아메리카노
370  기정수    유자차
371  기주봉   아이스티
372  백승환  바닐라라떼
373  계승현  레몬에이드

[374 rows x 2 columns]

In [52]:
pd.set_option('display.max_rows', 6)

In [53]:
pd.read_excel(url)

      이름     제품
0    백철민   아이스티
1    박태인  레몬에이드
2    국지용  아메리카노
..   ...    ...
371  기주봉   아이스티
372  백승환  바닐라라떼
373  계승현  레몬에이드

[374 rows x 2 columns]

In [57]:
df1 = pd.read_excel(url, sheet_name=0)
df2 = pd.read_excel(url, sheet_name=1)

In [58]:
df3 = df1.merge(df2, how='left', on='제품')

In [60]:
df3

      이름     제품    가격
0    백철민   아이스티  4400
1    박태인  레몬에이드  4400
2    국지용  아메리카노  3900
..   ...    ...   ...
371  기주봉   아이스티  4400
372  백승환  바닐라라떼  3900
373  계승현  레몬에이드  4400

[374 rows x 3 columns]

In [65]:
df3.to_excel("merge_result.xlsx", index=False)

## 03. 다중요건 vlookup

In [71]:
url = "/Users/mac/Documents/Mac mini/Python/1. 학습/1. 파이썬으로 할 수 있는 모든것/5. 데이터 분석 및 시각화/0. 강의자료/CH2_Excel file/02_03_merge02.xlsx"
df1 = pd.read_excel(url, sheet_name=0)
df2 = pd.read_excel(url, sheet_name=1)

In [75]:
df3 = df1.merge(df2, how='inner').to_excel("merge_result2.xlsx", index=False)

In [74]:
df3

      이름     제품     업체    가격  구분
0     백민  산채비빔밥  종가도시락  6700  한식
1    권상우  치킨도시락  두솥도시락  6300  한식
2    강인서  돈까스정식  두솥도시락  5700  일식
..   ...    ...    ...   ...  ..
371  백철민  돈까스정식  두솥도시락  5700  일식
372  김두진  산채비빔밥  종가도시락  6700  한식
373  김동수  돈까스정식  두솥도시락  5700  일식

[374 rows x 5 columns]

## 04. 행과 열의 이름 바꾸기

In [83]:
import pandas as pd
pd.set_option('display.max_rows', 6)
data1 = [['송중기', '별다방', '아이스티'],
         ['김나현', '콩다방', '카페오레'],
         ['권보아', '별다방', '카페오레'],
         ['박효신', '콩다방', '아이스티'],
         ['김범수', '별다방', '카페오레']]
data2 = [['별다방', '아이스티', 4500],
         ['별다방', '카페오레', 4000],
         ['콩다방', '아이스티', 6000],
         ['콩다방', '카페오레', 5500]]
df1 = pd.DataFrame(data1, columns=['이름', '업체', '음료'])
df2 = pd.DataFrame(data2, columns=['업체', '제품', '가격'])

In [79]:
df2.rename(columns={'제품':'음료'})

    업체    음료    가격
0  별다방  아이스티  4500
1  별다방  카페오레  4000
2  콩다방  아이스티  6000
3  콩다방  카페오레  5500

In [80]:
df2

    업체    제품    가격
0  별다방  아이스티  4500
1  별다방  카페오레  4000
2  콩다방  아이스티  6000
3  콩다방  카페오레  5500

In [81]:
df2.rename(columns={'제품':'음료'}, inplace=True)

In [82]:
df2

    업체    음료    가격
0  별다방  아이스티  4500
1  별다방  카페오레  4000
2  콩다방  아이스티  6000
3  콩다방  카페오레  5500

In [84]:
df1.merge(df2.rename(columns={'제품':'음료'}), how='left')

    이름   업체    음료    가격
0  송중기  별다방  아이스티  4500
1  김나현  콩다방  카페오레  5500
2  권보아  별다방  카페오레  4000
3  박효신  콩다방  아이스티  6000
4  김범수  별다방  카페오레  4000

## 05. 정렬하기

In [1]:
import pandas as pd

In [6]:
data = [[92],
        [75],
        [88],
        [62]]

In [7]:
idx = ['송중기', '김나현', '권보아', '박효신']

In [8]:
pd.DataFrame(data, index=idx, columns=['점수'])

     점수
송중기  92
김나현  75
권보아  88
박효신  62

In [9]:
data1 = [['송중기'],
         ['김나현'],
         ['권보아'],
         ['박효신']]
data2 = [[92],
         [75],
         [88],
         [62]]

In [ ]:
pd.DataFrame(data1, columns=['이름']).merge(pd.DataFrame(data2, columns=['점수']), left_index=True, right_index=True)